In [516]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to change the path if needed.)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read the School Data and Student Data and store into a Pandas DataFrame
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

# Cleaning Student Names and Replacing Substrings in a Python String
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

# Check names.
student_data_df.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

## Deliverable 1: Replace the reading and math scores.

### Replace the 9th grade reading and math scores at Thomas High School with NaN.

In [517]:
# Install numpy using conda install numpy or pip install numpy. 
# Step 1. Import numpy as np.
import numpy as np

In [518]:
# Step 2. Use the loc method on the student_data_df to select all the reading scores from the 9th grade at Thomas High School and replace them with NaN.

student_data_df.loc[(student_data_df['school_name'] =='Thomas High School') & (student_data_df['grade']=='9th') ,'reading_score'] = np.nan
#.student_data_df['reading_score'].replace('73',np.Nan)
#df['workclass'].replace('?', np.NaN)
student_data_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66.00,79
1,1,Victor Smith,M,12th,Huang High School,94.00,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90.00,60
3,3,Richard Scott,M,12th,Huang High School,67.00,58
4,4,Bonnie Ray,F,9th,Huang High School,97.00,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99.00,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95.00,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,nan,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99.00,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95.00,75

In [519]:
#  Step 3. Refactor the code in Step 2 to replace the math scores with NaN.
student_data_df.loc[(student_data_df['school_name'] =='Thomas High School') & (student_data_df['grade']=='9th') ,'math_score']=np.nan

In [520]:
#  Step 4. Check the student data for NaN's. 
student_data_df.loc[(student_data_df['school_name'] == 'Thomas High School') & (student_data_df['grade'] == '9th')]

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
37537,37537,Erik Snyder,M,9th,Thomas High School,nan,nan
37538,37538,Tanya Martinez,F,9th,Thomas High School,nan,nan
37539,37539,Noah Erickson,M,9th,Thomas High School,nan,nan
37540,37540,Austin Meyer,M,9th,Thomas High School,nan,nan
37543,37543,Madison Hampton,F,9th,Thomas High School,nan,nan
...,...,...,...,...,...,...,...
39152,39152,Lori Moore,F,9th,Thomas High School,nan,nan
39153,39153,William Hubbard,M,9th,Thomas High School,nan,nan
39157,39157,Kristen Gonzalez,F,9th,Thomas High School,nan,nan
39164,39164,Joseph Anthony,M,9th,Thomas High School,nan,nan
39167,39167,Rebecca Tanner,F,9th,Thomas High School,nan,nan

In [521]:
## Deliverable 2 : Repeat the school district analysis

In [522]:
### District Summary

In [523]:
# Combine the data into a single dataset
school_data_complete_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66.00,79.00,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94.00,61.00,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90.00,60.00,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67.00,58.00,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97.00,84.00,0,District,2917,1910635

In [524]:
# Calculate the Totals (Schools and Students)
school_count = len(school_data_complete_df["school_name"].unique())
student_count = school_data_complete_df["Student ID"].count()

# Calculate the Total Budget
total_budget = school_data_df["budget"].sum()

In [525]:
# Calculate the Average Scores using the "clean_student_data".
average_reading_score = school_data_complete_df["reading_score"].mean()
average_math_score = school_data_complete_df["math_score"].mean()

In [526]:
# Step 1. Get the number of students that are in ninth grade at Thomas High School.
# These students have no grades. 
thomashs_9th_count =student_data_df.loc[(student_data_df['school_name'] == 'Thomas High School') & (student_data_df['grade'] == '9th')].count()


# Get the total student count 
student_count = school_data_complete_df["Student ID"].count()


# Step 2. Subtract the number of students that are in ninth grade at 
# Thomas High School from the total student count to get the new total student count.
total_students = student_count - thomashs_9th_count['Student ID']
print(total_students)

38709

In [527]:
# Calculate the passing rates using the "clean_student_data".
passing_math_count = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)].count()["student_name"]
passing_reading_count = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)].count()["student_name"]

In [528]:
# Step 3. Calculate the passing percentages with the new total student count.
passing_math_percentage = passing_math_count /float(total_students) * 100
passing_reading_percentage = passing_reading_count/float(total_students) * 100

In [529]:
# Calculate the students who passed both reading and math.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)
                                               & (school_data_complete_df["reading_score"] >= 70)]

# Calculate the number of students that passed both reading and math.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()


# Step 4.Calculate the overall passing percentage with new total student count.
overall_passing_percentage = overall_passing_math_reading_count /total_students * 100
overall_passing_percentage

64.85571830840374

In [530]:
# Create a DataFrame
district_summary_df = pd.DataFrame(
          [
        { 
        "Total Schools": school_count, 
        "Total Students": student_count, 
        "Total Budget": total_budget,
        "Average Math Score": average_math_score, 
        "Average Reading Score": average_reading_score,
        "% Passing Math": passing_math_percentage,
        "% Passing Reading": passing_reading_percentage,
        "% Overall Passing": overall_passing_percentage
        }
        ])



# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
# Format the "Total Budget" to have the comma for a thousands separator, a decimal separator and a "$".
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)
# Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.1f}".format)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.1f}".format)
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.1f}".format)

# Display the data frame
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.9,81.9,74.8,85.7,64.9

In [531]:
##  School Summary

In [532]:
# Determine the School Type
per_school_types = school_data_df.set_index(["school_name"])["type"]

# Calculate the total student count.
per_school_counts = school_data_complete_df["school_name"].value_counts()

# Calculate the total school budget and per capita spending
per_school_budget = school_data_complete_df.groupby(["school_name"]).mean()["budget"]
# Calculate the per capita spending.
per_school_capita = per_school_budget / per_school_counts

# Calculate the average test scores.
per_school_math = school_data_complete_df.groupby(["school_name"]).mean()["math_score"]
per_school_reading = school_data_complete_df.groupby(["school_name"]).mean()["reading_score"]

# Calculate the passing scores by creating a filtered DataFrame.
per_school_passing_math = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)]
per_school_passing_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)]

# Calculate the number of students passing math and passing reading by school.
per_school_passing_math = per_school_passing_math.groupby(["school_name"]).count()["student_name"]
per_school_passing_reading = per_school_passing_reading.groupby(["school_name"]).count()["student_name"]

# Calculate the percentage of passing math and reading scores per school.
per_school_passing_math = per_school_passing_math / per_school_counts * 100
per_school_passing_reading = per_school_passing_reading / per_school_counts * 100

# Calculate the students who passed both reading and math.
per_passing_math_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)
                                               & (school_data_complete_df["math_score"] >= 70)]

# Calculate the number of students passing math and passing reading by school.
per_passing_math_reading = per_passing_math_reading.groupby(["school_name"]).count()["student_name"]

# Calculate the percentage of passing math and reading scores per school.
per_overall_passing_percentage = per_passing_math_reading / per_school_counts * 100

In [533]:
# Create the DataFrame
per_school_summary_df = pd.DataFrame({
    "School Type": per_school_types,
    "Total Students": per_school_counts,
    "Total School Budget": per_school_budget,
    "Per Student Budget": per_school_capita,
    "Average Math Score": per_school_math,
    "Average Reading Score": per_school_reading,
    "% Passing Math": per_school_passing_math,
    "% Passing Reading": per_school_passing_reading,
    "% Overall Passing": per_overall_passing_percentage})


per_school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,3124928.00,628.00,77.05,81.03,66.68,81.93,54.64
Cabrera High School,Charter,1858,1081356.00,582.00,83.06,83.98,94.13,97.04,91.33
Figueroa High School,District,2949,1884411.00,639.00,76.71,81.16,65.99,80.74,53.20
Ford High School,District,2739,1763916.00,644.00,77.10,80.75,68.31,79.30,54.29
Griffin High School,Charter,1468,917500.00,625.00,83.35,83.82,93.39,97.14,90.60

In [534]:
# Format the Total School Budget and the Per Student Budget
per_school_summary_df["Total School Budget"] = per_school_summary_df["Total School Budget"].map("${:,.2f}".format)
per_school_summary_df["Per Student Budget"] = per_school_summary_df["Per Student Budget"].map("${:,.2f}".format)

# Display the data frame
per_school_summary_df

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.05,81.03,66.68,81.93,54.64
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.06,83.98,94.13,97.04,91.33
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.71,81.16,65.99,80.74,53.20
Ford High School,District,2739,"$1,763,916.00",$644.00,77.10,80.75,68.31,79.30,54.29
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.35,83.82,93.39,97.14,90.60
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.29,80.93,66.75,80.86,53.53
Holden High School,Charter,427,"$248,087.00",$581.00,83.80,83.81,92.51,96.25,89.23
Huang High School,District,2917,"$1,910,635.00",$655.00,76.63,81.18,65.68,81.32,53.51
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.07,80.97,66.06,81.22,53.54
Pena High School,Charter,962,"$585,858.00",$609.00,83.84,84.04,94.59,95.95,90.54
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.84,80.74,66.37,80.22,52.99
Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.36,83.73,93.87,95.85,89.89
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.35,83.90,66.91,69.66,65.08
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.27,83.99,93.87,96.54,90.58
Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.68,83.95,93.33,96.61,90.33

In [535]:
# Step 5.  Get the number of 10th-12th graders from Thomas High School (THS).
thomashs_10through12_count_series = school_data_complete_df[(school_data_complete_df['school_name']=='Thomas High School') & (school_data_complete_df['grade'] != '9th')].count()
thomashs_10through12_count = thomashs_10through12_count_series['Student ID']
thomashs_10through12_count

1174

In [536]:
# Step 6. Get all the students passing math from THS
students_passing_math = school_data_complete_df[(school_data_complete_df['math_score']>=70) & (school_data_complete_df['school_name']== 'Thomas High School')].value_counts()

In [537]:
# Step 7. Get all the students passing reading from THS
students_passing_reading_count = school_data_complete_df[(school_data_complete_df['reading_score']>=70) & (school_data_complete_df['school_name']== 'Thomas High School')].value_counts()

In [538]:
# Step 8. Get all the students passing math and reading from THS
student_passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)& (school_data_complete_df["reading_score"] >= 70) & (school_data_complete_df['school_name']=='Thomas High School')].count()
student_passing_math_reading_count = student_passing_math_reading['Student ID']
student_passing_math_reading_count

1064

In [539]:
# Step 9. Calculate the percentage of 10th-12th grade students passing math from Thomas High School.
thomashs_10through12_math_percentage = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)& (school_data_complete_df["grade"] != '9th') & (school_data_complete_df['school_name'] == 'Thomas High School')].count()
passing_math_percent = thomashs_10through12_math_percentage['Student ID']/float(thomashs_10through12_count) * 100
passing_math_percent

93.18568994889267

In [540]:
# Step 10. Calculate the percentage of 10th-12th grade students passing reading from Thomas High School.
thomashs_10through12_reading_percentage = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)& (school_data_complete_df["grade"] != '9th') & (school_data_complete_df['school_name'] == 'Thomas High School')].count()
passing_reading_percent = thomashs_10through12_reading_percentage['Student ID']/float(thomashs_10through12_count) * 100
passing_reading_percent

97.01873935264055

In [541]:
# Step 11. Calculate the overall passing percentage of 10th-12th grade from Thomas High School.
thomashs_overall_passing_percentage = student_passing_math_reading_count / thomashs_10through12_count * 100
thomashs_overall_passing_percentage

90.63032367972743

In [542]:
# Step 12. Replace the passing math percent for Thomas High School in the per_school_summary_df.
per_school_summary_df.loc[(per_school_summary_df.index == 'Thomas High School'),'% Passing Math'] = passing_math_percent

In [543]:
# Step 13. Replace the passing reading percentage for Thomas High School in the per_school_summary_df.
per_school_summary_df.loc[(per_school_summary_df.index == 'Thomas High School'),'% Passing Reading'] = passing_reading_percent

In [544]:
# Step 14. Replace the overall passing percentage for Thomas High School in the per_school_summary_df.
per_school_summary_df.loc[(per_school_summary_df.index == 'Thomas High School'),'% Overall Passing'] = thomashs_overall_passing_percentage

In [545]:
# per_school_summary_df
per_school_summary_df

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.05,81.03,66.68,81.93,54.64
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.06,83.98,94.13,97.04,91.33
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.71,81.16,65.99,80.74,53.20
Ford High School,District,2739,"$1,763,916.00",$644.00,77.10,80.75,68.31,79.30,54.29
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.35,83.82,93.39,97.14,90.60
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.29,80.93,66.75,80.86,53.53
Holden High School,Charter,427,"$248,087.00",$581.00,83.80,83.81,92.51,96.25,89.23
Huang High School,District,2917,"$1,910,635.00",$655.00,76.63,81.18,65.68,81.32,53.51
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.07,80.97,66.06,81.22,53.54
Pena High School,Charter,962,"$585,858.00",$609.00,83.84,84.04,94.59,95.95,90.54
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.84,80.74,66.37,80.22,52.99
Shelton High School,Charter,1761,"$1,056,600.00",$600.00,83.36,83.73,93.87,95.85,89.89
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.35,83.90,93.19,97.02,90.63
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.27,83.99,93.87,96.54,90.58
Wright High School,Charter,1800,"$1,049,400.00",$583.00,83.68,83.95,93.33,96.61,90.33

In [546]:
## High and Low Performing Schools

In [572]:
# Sort and show top five schools.
top_performing_schools= per_school_summary_df.sort_values("% Overall Passing", ascending=False, inplace=False)
top_performing_schools.head(5)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Ranges (Per Student),School Size
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.06,83.98,94.13,97.04,91.33,<$585,Medium (1000-2000)
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.35,83.90,93.19,97.02,90.63,$615-645,Medium (1000-2000)
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.35,83.82,93.39,97.14,90.60,$615-645,Medium (1000-2000)
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.27,83.99,93.87,96.54,90.58,<$585,Large (2000-5000)
Pena High School,Charter,962,"$585,858.00",$609.00,83.84,84.04,94.59,95.95,90.54,$585-615,Small (<1000)

In [548]:
# Sort and show bottom five schools.
top_performing_schools= per_school_summary_df.sort_values("% Overall Passing", ascending=True, inplace=False)
top_performing_schools.head(5)

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.84,80.74,66.37,80.22,52.99
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.71,81.16,65.99,80.74,53.20
Huang High School,District,2917,"$1,910,635.00",$655.00,76.63,81.18,65.68,81.32,53.51
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.29,80.93,66.75,80.86,53.53
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.07,80.97,66.06,81.22,53.54

In [549]:
## Math and Reading Scores by Grade

In [550]:
# Create a Series of scores by grade levels using conditionals..
ninth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "9th")]
tenth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "10th")]
eleventh_graders = school_data_complete_df[(school_data_complete_df["grade"] == "11th")]
twelfth_graders = school_data_complete_df[(school_data_complete_df["grade"] == "12th")]

# Group each school Series by the school name for the average math score.
ninth_graders_avgmath_scores = ninth_graders.groupby(["school_name"]).mean()["math_score"]
tenth_graders_avgmath_scores = tenth_graders.groupby(["school_name"]).mean()["math_score"]
eleventh_graders_avgmath_scores = eleventh_graders.groupby(["school_name"]).mean()["math_score"]
twelfth_graders_avgmath_scores = twelfth_graders.groupby(["school_name"]).mean()["math_score"]

# Group each school Series by the school name for the average reading score.
ninth_graders_avgreading_scores = ninth_graders.groupby(["school_name"]).mean()["reading_score"]
tenth_graders_avgreading_scores = tenth_graders.groupby(["school_name"]).mean()["reading_score"]
eleventh_graders_avgreading_scores = eleventh_graders.groupby(["school_name"]).mean()["reading_score"]
twelfth_graders_avgreading_scores = twelfth_graders.groupby(["school_name"]).mean()["reading_score"]

In [551]:
# Combine each Series for average math scores by school into single data frame.
avgmath_scores_by_grade = pd.DataFrame({"9th": ninth_graders_avgmath_scores, "10th": tenth_graders_avgmath_scores,"11th": eleventh_graders_avgmath_scores, "12th": twelfth_graders_avgmath_scores})
avgmath_scores_by_grade

                        9th  10th  11th  12th
school_name
Bailey High School    77.08 77.00 77.52 76.49
Cabrera High School   83.09 83.15 82.77 83.28
Figueroa High School  76.40 76.54 76.88 77.15
Ford High School      77.36 77.67 76.92 76.18
Griffin High School   82.04 84.23 83.84 83.36
Hernandez High School 77.44 77.34 77.14 77.19
Holden High School    83.79 83.43 85.00 82.86
Huang High School     77.03 75.91 76.45 77.23
Johnson High School   77.19 76.69 77.49 76.86
Pena High School      83.63 83.37 84.33 84.12
Rodriguez High School 76.86 76.61 76.40 77.69
Shelton High School   83.42 82.92 83.38 83.78
Thomas High School      nan 83.09 83.50 83.50
Wilson High School    83.09 83.72 83.20 83.04
Wright High School    83.26 84.01 83.84 83.64

In [552]:
# Combine each Series for average reading scores by school into single data frame.
avgreading_scores_by_grade = pd.DataFrame({"9th": ninth_graders_avgreading_scores, "10th": tenth_graders_avgreading_scores,"11th":eleventh_graders_avgreading_scores, "12th": twelfth_graders_avgreading_scores})
avgreading_scores_by_grade

                        9th  10th  11th  12th
school_name
Bailey High School    81.30 80.91 80.95 80.91
Cabrera High School   83.68 84.25 83.79 84.29
Figueroa High School  81.20 81.41 80.64 81.38
Ford High School      80.63 81.26 80.40 80.66
Griffin High School   83.37 83.71 84.29 84.01
Hernandez High School 80.87 80.66 81.40 80.86
Holden High School    83.68 83.32 83.82 84.70
Huang High School     81.29 81.51 81.42 80.31
Johnson High School   81.26 80.77 80.62 81.23
Pena High School      83.81 83.61 84.34 84.59
Rodriguez High School 80.99 80.63 80.86 80.38
Shelton High School   84.12 83.44 84.37 82.78
Thomas High School      nan 84.25 83.59 83.83
Wilson High School    83.94 84.02 83.76 84.32
Wright High School    83.83 83.81 84.16 84.07

In [573]:
# Format each grade column.
pd.options.display.float_format = '{:.2f}'.format
avgmath_scores_by_grade["9th"]
avgmath_scores_by_grade["10th"] 
avgmath_scores_by_grade["11th"] 
avgmath_scores_by_grade["12th"]

Bailey High School      76.49
Cabrera High School     83.28
Figueroa High School    77.15
Ford High School        76.18
Griffin High School     83.36
Hernandez High School   77.19
Holden High School      82.86
Huang High School       77.23
Johnson High School     76.86
Pena High School        84.12
Rodriguez High School   77.69
Shelton High School     83.78
Thomas High School      83.50
Wilson High School      83.04
Wright High School      83.64
Name: 12th, dtype: float64

In [554]:
# Format each grade column.
pd.options.display.float_format = '{:.2f}'.format
avgreading_scores_by_grade["9th"] 
avgreading_scores_by_grade["10th"]
avgreading_scores_by_grade["11th"]
avgreading_scores_by_grade["12th"]

school_name
Bailey High School      80.91
Cabrera High School     84.29
Figueroa High School    81.38
Ford High School        80.66
Griffin High School     84.01
Hernandez High School   80.86
Holden High School      84.70
Huang High School       80.31
Johnson High School     81.23
Pena High School        84.59
Rodriguez High School   80.38
Shelton High School     82.78
Thomas High School      83.83
Wilson High School      84.32
Wright High School      84.07
Name: 12th, dtype: float64

In [555]:
# Remove the index.
avgmath_scores_by_grade = avgmath_scores_by_grade[["9th", "10th", "11th", "12th"]]
avgmath_scores_by_grade.index.name = None

# Display the data frame
avgmath_scores_by_grade

                        9th  10th  11th  12th
Bailey High School    77.08 77.00 77.52 76.49
Cabrera High School   83.09 83.15 82.77 83.28
Figueroa High School  76.40 76.54 76.88 77.15
Ford High School      77.36 77.67 76.92 76.18
Griffin High School   82.04 84.23 83.84 83.36
Hernandez High School 77.44 77.34 77.14 77.19
Holden High School    83.79 83.43 85.00 82.86
Huang High School     77.03 75.91 76.45 77.23
Johnson High School   77.19 76.69 77.49 76.86
Pena High School      83.63 83.37 84.33 84.12
Rodriguez High School 76.86 76.61 76.40 77.69
Shelton High School   83.42 82.92 83.38 83.78
Thomas High School      nan 83.09 83.50 83.50
Wilson High School    83.09 83.72 83.20 83.04
Wright High School    83.26 84.01 83.84 83.64

In [556]:
# Remove the index.
avgreading_scores_by_grade = avgreading_scores_by_grade[["9th", "10th", "11th", "12th"]]
avgreading_scores_by_grade.index.name = None

# Display the data frame
avgreading_scores_by_grade

                        9th  10th  11th  12th
Bailey High School    81.30 80.91 80.95 80.91
Cabrera High School   83.68 84.25 83.79 84.29
Figueroa High School  81.20 81.41 80.64 81.38
Ford High School      80.63 81.26 80.40 80.66
Griffin High School   83.37 83.71 84.29 84.01
Hernandez High School 80.87 80.66 81.40 80.86
Holden High School    83.68 83.32 83.82 84.70
Huang High School     81.29 81.51 81.42 80.31
Johnson High School   81.26 80.77 80.62 81.23
Pena High School      83.81 83.61 84.34 84.59
Rodriguez High School 80.99 80.63 80.86 80.38
Shelton High School   84.12 83.44 84.37 82.78
Thomas High School      nan 84.25 83.59 83.83
Wilson High School    83.94 84.02 83.76 84.32
Wright High School    83.83 83.81 84.16 84.07

In [557]:
## Scores by School Spending

In [558]:
# Establish the spending bins and group names.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

# Categorize spending based on the bins.
per_school_summary_df["Spending Ranges (Per Student)"] = pd.cut(per_school_capita, spending_bins, labels=group_names)

In [559]:
# Calculate averages for the desired columns.
spending_math_scores = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["Average Math Score"]
spending_reading_scores = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["Average Reading Score"]
spending_passing_math = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Passing Math"]
spending_passing_reading = per_school_summary_df.groupby(["Spending Ranges (Per Student)"]).mean()["% Passing Reading"]
overall_passing_rate = (spending_math_scores + spending_reading_scores) / 2

In [560]:
# Create the DataFrame
spending_summary = pd.DataFrame({"Average Math Score" : spending_math_scores,
                                 "Average Reading Score": spending_reading_scores,
                                 "% Passing Math": spending_passing_math,
                                 "% Passing Reading": spending_passing_reading,
                                 "% Overall Passing Rate": overall_passing_rate})
spending_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Spending Ranges (Per Student),,,,,
<$585,83.46,83.93,93.46,96.61,83.69
$585-615,83.60,83.89,94.23,95.90,83.74
$615-645,79.07,81.90,75.65,86.06,80.48
$645-675,77.00,81.03,66.16,81.13,79.01

In [561]:
# Format the DataFrame

pd.options.display.float_format = '{:.2f}'.format
spending_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
Spending Ranges (Per Student),,,,,
<$585,83.46,83.93,93.46,96.61,83.69
$585-615,83.60,83.89,94.23,95.90,83.74
$615-645,79.07,81.90,75.65,86.06,80.48
$645-675,77.00,81.03,66.16,81.13,79.01

In [562]:
## Scores by School Size

In [563]:
# Establish the bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]


# Categorize spending based on the bins.
per_school_summary_df["School Size"] = pd.cut(per_school_summary_df["Total Students"], size_bins, labels=group_names)

In [564]:
# Calculate averages for the desired columns.
size_math_scores = per_school_summary_df.groupby(["School Size"]).mean()["Average Math Score"]
size_reading_scores = per_school_summary_df.groupby(["School Size"]).mean()["Average Reading Score"]
size_passing_math = per_school_summary_df.groupby(["School Size"]).mean()["% Passing Math"]
size_passing_reading = per_school_summary_df.groupby(["School Size"]).mean()["% Passing Reading"]
overall_passing_rate = (size_passing_math + size_passing_reading) / 2

In [565]:
# Assemble into DataFrame. 
size_summary = pd.DataFrame({"Average Math Score" : size_math_scores,
                             "Average Reading Score": size_reading_scores,
                             "% Passing Math": size_passing_math,
                             "% Passing Reading": size_passing_reading,
                             "% Overall Passing Rate": overall_passing_rate})

In [566]:
# Format the DataFrame  
pd.options.display.float_format = '{:.2f}'.format
size_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Size,,,,,
Small (<1000),83.82,83.93,93.55,96.10,94.82
Medium (1000-2000),83.36,83.87,93.58,96.73,95.16
Large (2000-5000),77.75,81.34,69.96,82.77,76.36

In [567]:
## Scores by School Type

In [568]:
# Calculate averages for the desired columns. 
type_math_scores = per_school_summary_df.groupby(["School Type"]).mean()["Average Math Score"]
type_reading_scores = per_school_summary_df.groupby(["School Type"]).mean()["Average Reading Score"]
type_passing_math = per_school_summary_df.groupby(["School Type"]).mean()["% Passing Math"]
type_passing_reading = per_school_summary_df.groupby(["School Type"]).mean()["% Passing Reading"]
overall_passing_rate = (type_passing_math + type_passing_reading) / 2

In [569]:
# Assemble into DataFrame.
type_summary = pd.DataFrame({"Average Math Score" : type_math_scores,
                             "Average Reading Score": type_reading_scores,
                             "% Passing Math": type_passing_math,
                             "% Passing Reading": type_passing_reading,
                             "% Overall Passing Rate": overall_passing_rate})

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Type,,,,,
Charter,83.47,83.90,93.61,96.55,95.08
District,76.96,80.97,66.55,80.80,73.67

In [570]:
# # Format the DataFrame 
pd.options.display.float_format = '{:.2f}'.format
type_summary

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
School Type,,,,,
Charter,83.47,83.90,93.61,96.55,95.08
District,76.96,80.97,66.55,80.80,73.67